kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
/**
 * ============================================================================
 * โครงการวิจัย: ผลของการใช้นวัตกรรม Smart IV Alert ต่อความแม่นยำในการแจ้งเตือนและปริมาณสารน้ำที่ได้รับ
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น อำเภอสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: Bed Station Node (เครื่องตรวจวัดและแจ้งเตือนประจำเตียง)
 * เวอร์ชัน: 7.5.1 (Protocol v3 — ใช้คู่กับ Central Host Firmware 4.6.0 / 4.7.0)
 * บอร์ดประมวลผล: ESP32-S3 Super Mini + จอสี TFT 1.47" (ST7789 SPI 172x320) + Passive Buzzer
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.1: รื้อระบบคัดกรองหยดและหน้าคาลิเบรตใหม่ทั้งหมด
 *   หน้าจอ การสื่อสาร และการแจ้งเตือนเหมือน V7.5.0 ทุกประการ
 *
 *  ปัญหา 1 "นับเบิ้ล" — ของเดิมเมื่อค่าต่ำกว่าเกณฑ์แต่ยังไม่พ้นเวลากันรัว 55 ms
 *   จะไม่นับ แต่ก็ไม่เปลี่ยนสถานะ ตัวจับจึงยังง้างค้างอยู่ พอพ้น 55 ms ขณะที่
 *   สัญญาณยังต่ำอยู่ ก็นับซ้ำจากหยดเดิม (และนับอีกทุก 55 ms ที่ยังค้าง)
 *   -> ของใหม่นับตอน "พัลส์จบ" ที่จุดเดียว แล้วต้องกลับมานิ่งใต้เกณฑ์ปลด 20 ms
 *      ก่อนจึงรับพัลส์ถัดไป จึงได้ 1 พัลส์ = 1 หยด เสมอ (แก้อาการเหมือนสวิตช์ลั่น)
 *
 *  ปัญหา 2 "หาช่วงต่างยาก" — ของเดิมตั้งเกณฑ์จากค่ากึ่งกลางระหว่างกระเปาะมีน้ำ
 *   กับกระเปาะเปล่า ซึ่งเป็นค่านิ่ง 2 ค่า แต่หยดที่ตกผ่านลำแสงเป็นสัญญาณชั่วขณะ
 *   ที่เบนจากค่าปกติเพียงบางส่วน เกณฑ์กึ่งกลางจึงสูงเกินกว่าจะจับหยดได้จริง
 *   -> ของใหม่วัด "ระยะเบนจากเส้นฐาน" โดยเส้นฐานไล่ตามค่าปกติเองตลอดเวลา
 *      (กันการดริฟต์จากอุณหภูมิ แสงรอบข้าง และแรงดันไฟ) และตั้งเกณฑ์จาก
 *      หยดจริงที่วัดได้ในขั้นตอนคาลิเบรต ไม่ต้องหาค่ากึ่งกลางเองอีก
 *
 *  สิ่งที่เพิ่มในสายสัญญาณ
 *   - อ่าน ADC ที่คาบคงที่ 2 kHz (เดิมอ่านรอบละครั้งตามจังหวะ loop)
 *   - มีเดียน 5 จุด ตัดสไปก์เดี่ยวจาก ADC และจากจังหวะที่ ESP-NOW ส่งข้อมูล
 *   - เส้นฐานปรับอัตโนมัติ และหยุดนิ่งระหว่างที่พัลส์กำลังดำเนินอยู่
 *   - กรองตามความกว้างพัลส์ 2-150 ms (แคบไป = สัญญาณรบกวน, กว้างไป = ไม่ใช่หยด)
 *   - รู้ทิศสัญญาณเอง (หยดทำให้ค่าลดลงหรือเพิ่มขึ้น) ไม่ต้องตั้งค่าเอง
 *   - ถ้าการอ่านขาดช่วงเกิน 25 ms (เช่นเพิ่งวาดจอทั้งหน้า) จะตั้งต้นใหม่
 *     แทนที่จะเดาพัลส์ที่มองเห็นไม่ครบ
 *
 *  หน้าคาลิเบรตใหม่ 3 ขั้น + ตรวจสอบ (กดปุ่มค้าง 3 วินาที) พร้อมจอคลื่นสด
 *   1 NOISE  วัดพื้นสัญญาณรบกวนของเซ็นเซอร์ 3 วินาที (ขีดล่างของฮาร์ดแวร์)
 *   2 DROPS  เรียนรู้จากหยดจริง 10 หยด เก็บความสูงและความกว้างพัลส์
 *   3 RESULT ตั้งเกณฑ์ที่จุดกึ่งกลางระหว่าง "พ้นสัญญาณรบกวน 3 เท่า" กับ
 *            "ต่ำกว่าหยดที่จางที่สุด 55%" แล้วรายงาน SNR ให้เห็นขีดความสามารถจริง
 *   VERIFY   นับหยดสดให้เทียบกับตาตัวเองว่า 1 หยดขึ้น 1 จริง
 *
 * ---------------------------------------------------------------------------
 * เปลี่ยนใน V7.5.0: ออกแบบหน้าจอ TFT ใหม่ทั้งหมด (UX/UI สำหรับใช้งานจริงที่เตียง)
 *  - แนวคิด "IV BAG": หน้าหลักแสดงภาพถุงน้ำเกลือที่ระดับน้ำลดลงจริงตามปริมาณที่ให้ไปแล้ว
 *    พร้อมกระเปาะหยดที่มีภาพเคลื่อนไหวตามหยดจริง และตัวเลขสำคัญเพียง 4 ค่า
 *    (อัตราไหล / ปริมาณคงเหลือ / เวลาที่เหลือ / เวลาที่จะหมด)
 *  - ลดข้อความบนจอลงเหลือเท่าที่จำเป็น ใช้สีและตำแหน่งแทนคำอธิบาย
 *    แถบสถานะสีที่ขอบบนบอกภาวะของเตียงตั้งแต่แรกเห็น (เขียว/เหลือง/ส้ม/แดง/ฟ้า)
 *  - เพิ่มหน้าที่ 4: กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 30 นาที พร้อมเส้นอัตราเป้าหมาย
 *    ใช้ดูว่าการไหลสม่ำเสมอหรือมีช่วงที่ตกไป โดยไม่ต้องเปิดหน้าเว็บ
 *  - หน้า PLAN และ LINK จัดใหม่เป็นการ์ดตัวเลขใหญ่ อ่านได้จากปลายเตียง
 *  - จอเตือนวิกฤต/ใกล้หมดถุง/Screensaver ออกแบบใหม่ให้เหลือข้อความเท่าที่ต้องอ่าน
 *  - ตรรกะการวัด การสื่อสาร และการแจ้งเตือนทั้งหมดเหมือน V7.4.0 ทุกประการ
 *    (โครงสร้างแพ็กเก็ต Protocol v3 ไม่เปลี่ยน ใช้กับ Host เดิมได้ทันที)
 *
 * ---------------------------------------------------------------------------
 * เพิ่มใน V7.4.0: แจ้งเตือนใกล้หมด (เตรียมถุงใหม่)
 *  - เตือนเมื่อให้สารน้ำไปแล้วถึง % ที่ตั้งจากหน้าเว็บ (ค่าเริ่มต้น 80% ของปริมาตรตามแผน)
 *  - แสดงจอสีส้ม "PREPARE NEXT BAG" + เสียงเตือนเบา 3 ครั้ง ซ้ำทุก 5 นาทีจนกว่าจะกดรับทราบ
 *  - คลิกปุ่มที่เตียง หรือกดรับทราบที่ Host/หน้าเว็บ = รับทราบ (ซิงก์กันทั้งระบบ)
 *  - ไม่นับเป็นเหตุวิกฤต ไม่เข้าจอ EMERGENCY สีแดง
 *
 * สรุปการแก้ไขจาก V7.2.3
 *  1) โครงสร้างแพ็กเก็ต ESP-NOW ตรงกับ Host ทุกไบต์ (มี static_assert ตรวจขนาด)
 *     ส่งอัตราไหล + เวลาตั้งแต่หยดล่าสุด + แรงดันแบตเตอรี่ (ถ้ามีวงจร)
 *  2) รับ Drop factor จาก Host แทนค่าคงที่ 20 gtt/mL
 *  3) แก้แจ้งเตือนสายพับผิด: เดิมเข้า EMERGENCY ทันทีหลังหยดแรก และค้างเมื่อกดหยุดชั่วคราว
 *     -> ใช้เกณฑ์ "ไม่มีหยดนานเกิน 2.5 เท่าของช่วงหยดตามเป้าหมาย (ขั้นต่ำ 8 วินาที)" สูตรเดียวกับ Host
 *  4) รหัสเตือน เร็ว/ช้าเกิน/ครบแผน มาจาก Host (มีหน่วงยืนยัน 20 วินาที) — สายพับตัดสินในเครื่องทันที
 *  5) ค้นหาช่องสัญญาณของ Host อัตโนมัติ (Channel 1-13) เมื่อขาดการเชื่อมต่อ และจำช่องล่าสุด
 *  6) ลดการวาดจอ TFT ทุกรอบ loop -> วาดเฉพาะเมื่อสถานะเปลี่ยน ไม่แย่งเวลาอ่าน ADC ตรวจจับหยด
 *  7) รองรับคำสั่ง "เริ่มถุงใหม่" จากหน้าเว็บ (รีเซ็ตตัวนับ)
 *  8) ในจอ EMERGENCY: คลิก 1 ครั้ง = พักเสียง 2 นาที, ดับเบิลคลิก = หยุด/เริ่มนับ
 *  9) Screensaver ทำงานจริงเมื่อไม่มีการกดปุ่ม 3 นาที (คลิกเพื่อปลุก)
 * 10) ไฟ RGB แสดงสถานะ: แดง=เตือน, เหลือง=หยุดชั่วคราว, น้ำเงิน=ไม่พบ Host, เขียว=ปกติ
 *
 * การใช้ปุ่ม (ปุ่มเดียว)
 *  - คลิก 1 ครั้ง      : เปลี่ยนหน้า 1/2/3/4  (ในจอเตือน = พักเสียง 2 นาที)
 *  - ดับเบิลคลิก       : หยุด/เริ่มนับหยด (PAUSE)
 *  - คลิก 3 ครั้ง      : ตั้งหมายเลขเตียง 1-8
 *  - กดค้าง 3 วินาที   : Calibration Wizard (วัดสัญญาณรบกวน + เรียนรู้จากหยดจริง)
 *  - กดค้าง 5 วินาที   : หน้าผู้พัฒนา
 * ============================================================================
 */

#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>

#define APP_VERSION         "7.5.1"

#define TFT_CS              9
#define TFT_DC              10
#define TFT_RST             11
#define TFT_MOSI            12
#define TFT_SCLK            13
#define TFT_BLK             8

#define SENSOR_AO_PIN       4
#define BUZZER_PIN          3
#define BTN_PIN             2
#define RGB_LED_PIN         48

// วงจรวัดแบตเตอรี่ (ถ้ามี): ใส่หมายเลขขา ADC ที่ต่อผ่านตัวต้านทานแบ่งแรงดัน 1:1 เช่น 1
// -1 = ไม่มีวงจร -> ส่งค่า 0 และหน้าเว็บ/Host แสดง "N/A"
#define STATION_BAT_ADC_PIN -1
#define BAT_DIVIDER_RATIO   2.0f

// ----------------------------------------------------------------------------
// ตัวตรวจจับหยด (v7.5.1) — ทำงานกับ "ระยะเบนจากเส้นฐาน" ไม่ใช่ค่า ADC สัมบูรณ์
// ----------------------------------------------------------------------------
#define SENSOR_SAMPLE_US        500    // อ่าน ADC ทุก 0.5 ms (2 kHz) พัลส์ 10 ms จึงได้ ~20 จุด
#define SENSOR_MEDIAN_N         5      // มีเดียน 5 จุด ตัดสไปก์เดี่ยวของ ADC/ตอนส่ง ESP-NOW
#define SENSOR_GAP_RESYNC_MS    25     // อ่านขาดช่วงนานกว่านี้ = ตั้งต้นใหม่ ไม่เดาพัลส์ที่เห็นไม่ครบ
#define BASELINE_STEP_DIV       1024   // ยิ่งมากเส้นฐานยิ่งไล่ตามช้า (~0.5 วินาทีที่ 2 kHz)
#define NOISE_WINDOW_MS         1000   // คาบวัดสัญญาณรบกวนยอดถึงยอด
#define DROP_MIN_WIDTH_MS       2      // พัลส์แคบกว่านี้ = สัญญาณรบกวน ไม่ใช่หยด
#define DROP_MAX_WIDTH_MS       150    // กว้างกว่านี้ = ระดับน้ำเปลี่ยน/มีอะไรบัง ไม่ใช่หยด
#define DROP_REARM_MS           20     // ต้องกลับมานิ่งใต้เกณฑ์ปลดเท่านี้ ก่อนรับหยดถัดไป

#define CAL_DEFAULT_TRIGGER     120    // ใช้เมื่อยังไม่เคยคาลิเบรต
#define CAL_MIN_TRIGGER         18
#define CAL_NOISE_MS            3000
#define CAL_POLARITY_MS         6000
#define CAL_LEARN_TIMEOUT_MS    60000
#define CAL_TARGET_DROPS        10
#define CAL_MIN_DROPS           5
#define CAL_MAX_SAMPLES         12
#define CAL_VERIFY_MS           20000
#define SCOPE_TOP               82

// ----------------------------------------------------------------------------
// ค่าคงที่ของระบบสื่อสารและการแจ้งเตือน (ต้องตรงกับ Host)
// ----------------------------------------------------------------------------
#define DEFAULT_ESPNOW_CHANNEL  1
#define MAX_WIFI_CHANNEL        13
#define HOST_TIMEOUT_MS         5000
#define CHANNEL_SCAN_DWELL_MS   2500     // Host ส่ง Sync ทุก 1 วินาที -> รอแต่ละช่อง 2.5 วินาที
#define CHANNEL_SCAN_START_MS   6000     // หลังบูตรอช่องที่จำไว้ก่อน 6 วินาที
#define SEND_INTERVAL_MS        1000
#define MIN_OCCLUSION_MS        8000
#define MAX_OCCLUSION_MS        300000
#define SCREENSAVER_IDLE_MS     180000
#define SNOOZE_MS               120000
#define NEAR_END_REMIND_MS      300000   // เตือนใกล้หมดซ้ำทุก 5 นาทีจนกว่าจะรับทราบ
#define DEFAULT_NEAR_END_PCT    80

#define ALERT_NONE        0
#define ALERT_TOO_FAST    1
#define ALERT_TOO_SLOW    2
#define ALERT_NEAR_END    3   // ให้ไปแล้วถึง % ที่ตั้ง (เตรียมถุงใหม่)
#define ALERT_COMPLETE    4
#define ALERT_OCCLUSION   5

#define THEME_BG            0x0000
#define THEME_SKYBLUE       0x5DFF
#define THEME_CYAN          0x07FF
#define THEME_PINK          0xFD79
#define THEME_NAVY          0x09CD
#define THEME_DARKBOX       0x18C5
#define THEME_MAROON        0x6000

#define COLOR_WHITE         0xFFFF
#define COLOR_GREEN         0x07E0
#define COLOR_RED           0xF800
#define COLOR_ORANGE        0xFD20
#define COLOR_YELLOW        0xFFE0

// ชุดสีของหน้าจอรุ่นใหม่ (พื้นดำ การ์ดเทาเข้ม ตัวอักษรรองสีเทา)
#define UI_CARD             0x18C5   // พื้นการ์ด
#define UI_BAR              0x0A49   // แถบบนสุด
#define UI_LINE             0x39E7   // เส้นคั่น/แถบว่าง
#define UI_DIM              0x8410   // ข้อความรอง
#define UI_GREEN            0x2FEB   // เขียวอ่านง่ายบนพื้นดำ

