kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
#ifndef ST77XX_LIGHTGREY
  #define ST77XX_LIGHTGREY  0xC618
#endif
#ifndef ST77XX_DARKGREY
  #define ST77XX_DARKGREY   0x39E7
#endif

SPIClass SPI_TFT(FSPI);
Adafruit_ST7789 tft = Adafruit_ST7789(&SPI_TFT, TFT_CS, TFT_DC, TFT_RST);
Preferences stationPrefs;

enum AppState {
  STATE_NORMAL_VIEW,
  STATE_EMERGENCY,
  STATE_SCREENSAVER,
  STATE_CREDIT,
  STATE_CONFIG_ID,
  STATE_NEAR_END_NOTICE
};

// ---- สถานะที่ใช้เลือกสีและคำบนจอ ----
// ต้องประกาศไว้ตอนต้นไฟล์ เพราะ Arduino IDE แทรก prototype ของฟังก์ชันไว้ก่อนส่วนแสดงผล
enum UiStatus { UI_OK = 0, UI_FAST, UI_SLOW, UI_NOFLOW, UI_NEAREND, UI_DONE, UI_PAUSED };

AppState currentState       = STATE_NORMAL_VIEW;
int currentNursePage        = 1;
uint8_t currentStationId    = 1;
uint8_t tempConfigStationId = 1;
unsigned long configAutoSaveTimeout = 0;
unsigned long lastUserActivityTime  = 0;

bool isRunning              = true;
bool isClockSynced          = false;
volatile bool isHostOnline  = false;
volatile int lastHostRssi   = -100;
volatile unsigned long lastHostRecvTime = 0;
bool stateNeedsRedraw       = true;

// ---- สัญญาณและการตรวจจับหยด (ประกาศชนิดไว้ตอนต้นไฟล์ เพราะ Arduino แทรก prototype ก่อนฟังก์ชันแรก) ----
enum DropPhase { DP_IDLE, DP_ACTIVE, DP_REARM };

int8_t  dropPolarity     = -1;                       // -1 = หยดทำให้ค่า ADC ลดลง, +1 = เพิ่มขึ้น
int     dropTriggerDelta = CAL_DEFAULT_TRIGGER;      // เบนจากเส้นฐานเท่านี้ = เริ่มนับว่าเป็นพัลส์
int     dropReleaseDelta = CAL_DEFAULT_TRIGGER * 2 / 5;  // ต่ำกว่านี้ = พัลส์จบ (ฮิสเทอรีซิส)
int     calDropAmp       = 0;                        // ความสูงพัลส์กลางจากตอนคาลิเบรต
int     calNoisePp       = 0;                        // สัญญาณรบกวนยอดถึงยอดตอนคาลิเบรต
uint8_t calSnrX10        = 0;                        // อัตราส่วนสัญญาณต่อสัญญาณรบกวน คูณ 10
uint8_t calQuality       = 0;                        // 0 = ยังไม่คาลิเบรต/อ่อนเกินไป ... 4 = ดีมาก
int     lastDropPeak     = 0;
int     lastDropWidthMs  = 0;

// ----------------------------------------------------------------------------
// โครงสร้างข้อมูลรับ-ส่ง ESP-NOW (Protocol v2) — ต้องเหมือนกับ Host ทุกไบต์
// ----------------------------------------------------------------------------
typedef struct __attribute__((packed)) struct_message {
  uint8_t  stationId;
  uint8_t  isRunning;
  uint32_t totalDrops;
  uint32_t periodDrops;
  float    flowRateHr;
  uint32_t msSinceLastDrop;
  float    batteryVolts;
  uint8_t  flags;            // bit0 = พยาบาลกดรับทราบเตือนใกล้หมดที่เตียง
} struct_message;            // 23 bytes

typedef struct __attribute__((packed)) struct_host_sync {
  uint32_t epochTime;
  uint8_t  isSynced;
  uint8_t  stationId;
  float    targetRateHr;
  float    totalPlanMl;
  uint8_t  alertCode;
  uint8_t  dropFactor;
  uint8_t  resetSeq;
  uint8_t  hostChannel;
  uint8_t  nearEndPct;       // % ของปริมาตรตามแผนที่เริ่มเตือนใกล้หมด
  uint8_t  flags;            // bit0 = Host บันทึกว่ารับทราบเตือนใกล้หมดแล้ว
} struct_host_sync;          // 20 bytes

static_assert(sizeof(struct_message) == 23, "struct_message must be 23 bytes (match Host)");
static_assert(sizeof(struct_host_sync) == 20, "struct_host_sync must be 20 bytes (match Host)");

struct_message myData;
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

uint32_t totalDrops                 = 0;
uint32_t periodDropsCounter         = 0;

float currentFlowRate_ml_hr         = 0.0;
float currentGttMin                 = 0.0;
float totalVolumeMl                 = 0.0;

// ค่าจาก Host (0 = Host ยังไม่ได้ตั้งค่า)
volatile float targetRateHr         = 0.0;
volatile float totalPlanMl          = 0.0;
volatile uint8_t hostAlertCode      = ALERT_NONE;
volatile uint8_t dropFactor         = 20;
volatile uint8_t hostReportedChannel = 0;
volatile bool pendingCounterReset   = false;
volatile uint8_t nearEndPct         = DEFAULT_NEAR_END_PCT;
volatile bool hostNearEndAck        = false;   // Host ยืนยันว่ารับทราบแล้ว
bool nearEndAckRequest              = false;   // กดรับทราบที่เตียง รอ Host ยืนยัน
unsigned long nearNextChimeTime     = 0;
uint8_t nearChimeRemaining          = 0;
int16_t knownResetSeq               = -1;

uint8_t espnowChannel               = DEFAULT_ESPNOW_CHANNEL;
uint8_t savedChannel                = DEFAULT_ESPNOW_CHANNEL;
unsigned long lastChannelHopTime    = 0;

unsigned long lastDropTimestamp     = 0;
bool hasFirstDropOccurred           = false;
bool skipNextInterval               = false;

unsigned long lastSendTime          = 0;
unsigned long lastDebounceTime      = 0;
unsigned long snoozeUntilTime       = 0;
const unsigned long minDropInterval = 55;

unsigned long buzzerBeepUntil       = 0;
unsigned long buzzerNextBeepTime    = 0;

bool isDropFalling                  = false;
unsigned long dropFallStartTime     = 0;
int animDropY                       = 190;
int animDropPrevY                   = 190;
int8_t animModeDrawn                = -1;
unsigned long lastAnimFrame         = 0;
unsigned long poolFlashUntil        = 0;
const int CHAMBER_NOZZLE_Y          = 190;   // ตำแหน่งปลายหยดในกระเปาะ (หน้าจอใหม่)
const int CHAMBER_POOL_Y            = 204;   // ผิวน้ำในกระเปาะ
const unsigned long DROP_FALL_DURATION = 160;

bool isHoldUiActive                 = false;
bool holdBeep3sDone                 = false;
bool holdBeep5sDone                 = false;
unsigned long lastHoldRenderTime    = 0;

// ---- รหัสเตือนที่หน้าจอใช้ (อัปเดตทุกรอบใน loop) ----
uint8_t uiAlertCode = ALERT_NONE;

// ---- แคชของหน้าจอ: วาดใหม่เฉพาะเมื่อค่าที่แสดงเปลี่ยนจริง ----
String cacheClock = "";
int    cacheBars = -9999;
int    cacheStatusBar = -1;
bool   cacheBedChip = false;
int    cacheRate = -9999, cacheTarget = -9999, cacheLeftMl = -9999;
int    cachePct = -999, cacheBagPct = -999;
String cacheTimeLeft = "", cacheEndClock = "", cacheStatusWord = "";
String cacheP2a = "", cacheP2b = "", cacheP2c = "", cacheP2d = "", cacheP2foot = "";
String cacheP3a = "", cacheP3b = "", cacheP3c = "";
String cacheP4 = "", cacheNear = "", cacheConfig = "";
uint8_t lastEmergencyCode = 255;

