kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> CALIBRATE (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = CALIB", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ============================================================================
// เครื่องตรวจจับหยด v7.5.1 — ตัวกรอง + เส้นฐานปรับอัตโนมัติ + จับเป็น "เหตุการณ์"
// ----------------------------------------------------------------------------
// ปัญหาของ v7.5.0 ที่แก้ตรงนี้
//  1) นับเบิ้ล: โค้ดเดิมเมื่อค่าต่ำกว่าเกณฑ์แต่ยังไม่พ้นเวลากันรัว จะ "ไม่นับ
//     แต่ก็ไม่เปลี่ยนสถานะ" ตัวจับจึงยังง้างอยู่ พอพ้น 55 ms ขณะที่สัญญาณยัง
//     ต่ำอยู่ ก็นับซ้ำจากหยดเดิมทันที (และนับอีกทุก ๆ 55 ms ที่ค้างอยู่)
//     -> ของใหม่นับตอน "พัลส์จบ" ที่เดียว และต้องกลับมานิ่งใต้เกณฑ์ปลดก่อน
//        จึงจะรับหยดถัดไปได้ 1 พัลส์ = 1 หยด เสมอ
//  2) หาช่วงต่างยาก: โค้ดเดิมตั้งเกณฑ์จากค่ากึ่งกลางระหว่าง "กระเปาะมีน้ำ" กับ
//     "กระเปาะเปล่า" ซึ่งเป็นค่านิ่งสองค่า แต่หยดที่ตกผ่านลำแสงเป็นสัญญาณชั่วขณะ
//     ที่เบนจากค่าปกติเพียงบางส่วน เกณฑ์กึ่งกลางจึงสูงเกินจะจับหยดได้
//     -> ของใหม่วัดจาก "ระยะเบนจากเส้นฐาน" ที่ไล่ตามค่าปกติเองตลอดเวลา
//        และตั้งเกณฑ์จากหยดจริงที่วัดได้ในขั้นตอนคาลิเบรต
// ============================================================================

int  sensorRaw          = 0;      // ค่าดิบล่าสุดจาก ADC
int  sensorFiltered     = 0;      // หลังผ่านมีเดียน (ตัดสไปก์เดี่ยว)
long baselineAcc        = 0;      // เส้นฐาน เก็บคูณ 256 ไว้ให้ละเอียด
int  sensorBaseline     = 0;      // เส้นฐาน = ค่าปกติตอนไม่มีหยด
int  sensorDelta        = 0;      // ระยะเบนจากเส้นฐานในทิศที่แปลว่า "มีหยด"
int  sensorNoisePp      = 0;      // สัญญาณรบกวนยอดถึงยอดของช่วงที่ไม่มีหยด
bool sensorReady        = false;

int medBuf[SENSOR_MEDIAN_N];
uint8_t medIdx = 0;
uint8_t medFill = 0;

int  noiseMin = 4095, noiseMax = 0;
unsigned long noiseWindowStart = 0;

DropPhase dropPhase       = DP_IDLE;
unsigned long dropPhaseMs = 0;
int  dropPeakDelta        = 0;
uint32_t lastSampleUs     = 0;
uint32_t rejectedPulses   = 0;    // พัลส์ที่คัดทิ้ง (แคบหรือกว้างผิดปกติ)

void resetSignalChain(int seed) {
  for (int i = 0; i < SENSOR_MEDIAN_N; i++) medBuf[i] = seed;
  medIdx = 0; medFill = SENSOR_MEDIAN_N;
  sensorFiltered = seed;
  baselineAcc = (long)seed * 256;
  sensorBaseline = seed;
  sensorDelta = 0;
  dropPhase = DP_REARM;
  dropPhaseMs = millis();
  dropPeakDelta = 0;
  noiseMin = seed; noiseMax = seed;
  noiseWindowStart = millis();
  sensorReady = true;
}

int pushMedian(int v) {
  medBuf[medIdx] = v;
  medIdx = (uint8_t)((medIdx + 1) % SENSOR_MEDIAN_N);
  if (medFill < SENSOR_MEDIAN_N) medFill++;
  int t[SENSOR_MEDIAN_N];
  memcpy(t, medBuf, sizeof(t));
  for (int i = 1; i < SENSOR_MEDIAN_N; i++) {         // เรียงแบบแทรก (N=5 เร็วกว่า qsort)
    int k = t[i], j = i - 1;
    while (j >= 0 && t[j] > k) { t[j + 1] = t[j]; j--; }
    t[j + 1] = k;
  }
  return t[SENSOR_MEDIAN_N / 2];
}

// delta > 0 = สัญญาณเบนไปทางที่แปลว่า "มีหยดผ่านลำแสง"
// dropPolarity -1 = หยดทำให้ค่าลดลง (ค่าเริ่มต้น), +1 = หยดทำให้ค่าเพิ่มขึ้น
inline int deltaFromBaseline(int filtered) {
  return (dropPolarity < 0) ? (sensorBaseline - filtered) : (filtered - sensorBaseline);
}

// บันทึกหยด 1 หยด — eventMs คือเวลาที่พัลส์ "เริ่ม" ซึ่งเป็นจังหวะจริงที่หยดผ่านลำแสง
void registerDrop(unsigned long eventMs) {
  totalDrops++;
  periodDropsCounter++;

  isDropFalling = true;
  dropFallStartTime = millis();
  animDropY = CHAMBER_NOZZLE_Y;

  uint8_t df = safeDropFactor(dropFactor);
  if (hasFirstDropOccurred && !skipNextInterval) {
    unsigned long dropDeltaMs = eventMs - lastDropTimestamp;
    if (dropDeltaMs > minDropInterval && dropDeltaMs < MAX_OCCLUSION_MS) {
      float instantGttMin   = 60000.0f / (float)dropDeltaMs;
      float instantRateMlHr = (instantGttMin * 60.0f) / (float)df;
      if (currentFlowRate_ml_hr == 0.0f) currentFlowRate_ml_hr = instantRateMlHr;
      else currentFlowRate_ml_hr = (instantRateMlHr * 0.75f) + (currentFlowRate_ml_hr * 0.25f);
    }
  }
  hasFirstDropOccurred = true;
  skipNextInterval = false;
  lastDropTimestamp = eventMs;
  currentGttMin = (currentFlowRate_ml_hr * (float)df) / 60.0f;
  totalVolumeMl = (float)totalDrops / (float)df;
}

// อ่านเซนเซอร์ 1 ครั้งตามคาบที่กำหนด แล้วเดินเครื่องจักรสถานะ
// countDrops = false ใช้ตอนคาลิเบรต/หยุดชั่วคราว (ยังอัปเดตเส้นฐานและสัญญาณรบกวนตามปกติ)
// คืนค่า true เมื่อเพิ่ง "จบพัลส์ที่ผ่านเกณฑ์" ในรอบนี้
bool serviceDropSensor(bool countDrops) {
  uint32_t nowUs = micros();
  uint32_t dtUs  = nowUs - lastSampleUs;
  if (dtUs < SENSOR_SAMPLE_US) return false;
  lastSampleUs = nowUs;

  sensorRaw = analogRead(SENSOR_AO_PIN);

  // ขาดช่วงการอ่านนาน (เช่นเพิ่งวาดจอทั้งหน้า) -> ตั้งต้นใหม่ ไม่เดาพัลส์ที่เห็นไม่ครบ
  if (!sensorReady || dtUs > (uint32_t)SENSOR_GAP_RESYNC_MS * 1000UL) {
    resetSignalChain(sensorRaw);
    return false;
  }

  sensorFiltered = pushMedian(sensorRaw);
  sensorBaseline = (int)(baselineAcc / 256);
  sensorDelta    = deltaFromBaseline(sensorFiltered);

