kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
  unsigned long nowMs = millis();
  bool completed = false;

  // เส้นฐานไล่ตามการดริฟต์ (อุณหภูมิ/แสงรอบข้าง/แรงดันไฟ) เฉพาะตอนไม่มีพัลส์
  if (dropPhase == DP_IDLE) {
    baselineAcc += ((long)sensorFiltered * 256 - baselineAcc) / BASELINE_STEP_DIV;

    if (abs(sensorDelta) < dropTriggerDelta / 2) {     // วัดสัญญาณรบกวนจากช่วงที่สงบจริง ๆ
      if (sensorFiltered < noiseMin) noiseMin = sensorFiltered;
      if (sensorFiltered > noiseMax) noiseMax = sensorFiltered;
    }
    if (nowMs - noiseWindowStart >= NOISE_WINDOW_MS) {
      if (noiseMax >= noiseMin) sensorNoisePp = noiseMax - noiseMin;
      noiseMin = sensorFiltered; noiseMax = sensorFiltered;
      noiseWindowStart = nowMs;
    }
  }

  switch (dropPhase) {
    case DP_IDLE:
      if (sensorDelta >= dropTriggerDelta) {
        dropPhase = DP_ACTIVE;
        dropPhaseMs = nowMs;
        dropPeakDelta = sensorDelta;
      }
      break;

    case DP_ACTIVE: {
      if (sensorDelta > dropPeakDelta) dropPeakDelta = sensorDelta;
      unsigned long width = nowMs - dropPhaseMs;

      if (sensorDelta <= dropReleaseDelta) {
        // พัลส์จบ -> ตัดสินใจ "ที่เดียว" จึงนับได้ไม่เกิน 1 ครั้งต่อ 1 พัลส์
        if (width >= DROP_MIN_WIDTH_MS) {
          lastDropPeak    = dropPeakDelta;
          lastDropWidthMs = (int)width;
          completed = true;
          if (countDrops) registerDrop(dropPhaseMs);
        } else {
          rejectedPulses++;                 // แคบเกินกว่าจะเป็นหยด = สัญญาณรบกวน
        }
        dropPhase = DP_REARM;
        dropPhaseMs = nowMs;
      }
      else if (width > DROP_MAX_WIDTH_MS) {
        // ค้างนานผิดปกติ = ไม่ใช่หยด (ระดับน้ำเปลี่ยน / มีอะไรบังลำแสง)
        // ไม่นับ แล้วปล่อยให้เส้นฐานไล่ตามค่าที่ค้าง เพื่อกลับมาตรวจจับได้เอง
        rejectedPulses++;
        dropPhase = DP_REARM;
        dropPhaseMs = nowMs;
      }
      break;
    }

    case DP_REARM:
      // ต้องกลับมานิ่งใต้เกณฑ์ปลดต่อเนื่องครบเวลา จึงจะรับพัลส์ถัดไป
      // นี่คือส่วนที่ทำให้ "กดสวิตช์แล้วลั่น" หายไป
      if (sensorDelta > dropReleaseDelta) {
        dropPhaseMs = nowMs;
        baselineAcc += ((long)sensorFiltered * 256 - baselineAcc) / (BASELINE_STEP_DIV * 4);
      } else if (nowMs - dropPhaseMs >= DROP_REARM_MS) {
        dropPhase = DP_IDLE;
      }
      break;
  }

  return completed;
}

// ============================================================================
// จอออสซิลโลสโคปเล็ก ๆ สำหรับหน้าคาลิเบรต
// แสดง "ระยะเบนจากเส้นฐาน" ตามเวลา จึงเห็นชัดว่าอันไหนคือหยด อันไหนคือช่วงว่าง
// ============================================================================
#define SCOPE_X            7
#define SCOPE_W            158
#define SCOPE_H            72
#define SCOPE_MS_PER_COL   16          // 1 คอลัมน์ = 16 ms -> เห็นย้อนหลัง ~2.5 วินาที

int16_t scopeCol[SCOPE_W];
uint8_t scopeHead = 0;
int scopeColMax = 0;
int scopeFull = 200;                   // ค่าที่ทำให้แท่งสูงเต็มจอ
int scopeFixedFull = 0;                // > 0 = ล็อกสเกลไว้เอง (ใช้ตอนวัดสัญญาณรบกวน)
unsigned long scopeColStart = 0;

void scopeReset() {
  for (int i = 0; i < SCOPE_W; i++) scopeCol[i] = 0;
  scopeHead = 0;
  scopeColMax = 0;
  scopeColStart = millis();
}

void scopePush(int delta) {
  if (delta < 0) delta = 0;
  if (delta > scopeColMax) scopeColMax = delta;
  unsigned long now = millis();
  if (now - scopeColStart < SCOPE_MS_PER_COL) return;
  scopeColStart = now;
  scopeCol[scopeHead] = (int16_t)scopeColMax;
  scopeHead = (uint8_t)((scopeHead + 1) % SCOPE_W);
  scopeColMax = delta;
}

void scopeFrame(int y) {
  tft.drawRect(SCOPE_X - 1, y - 1, SCOPE_W + 2, SCOPE_H + 2, UI_LINE);
}

int scopeYof(int y, int value) {
  if (scopeFull < 20) scopeFull = 20;
  long h = (long)value * (SCOPE_H - 1) / scopeFull;
  if (h < 0) h = 0;
  if (h > SCOPE_H - 1) h = SCOPE_H - 1;
  return y + SCOPE_H - 1 - (int)h;
}

void scopeDraw(int y) {
  // ปรับสเกลอัตโนมัติให้พัลส์ที่เห็นอยู่พอดีจอ (หรือใช้สเกลที่ล็อกไว้)
  if (scopeFixedFull > 0) {
    scopeFull = scopeFixedFull;
  } else {
    int peak = dropTriggerDelta * 2;
    for (int i = 0; i < SCOPE_W; i++) if (scopeCol[i] > peak) peak = scopeCol[i];
    scopeFull = (peak * 12) / 10;
    if (scopeFull < 40) scopeFull = 40;
  }

  int yTrig = scopeYof(y, dropTriggerDelta);
  int yRel  = scopeYof(y, dropReleaseDelta);
  int yNoise = scopeYof(y, sensorNoisePp);

  for (int i = 0; i < SCOPE_W; i++) {
    int x = SCOPE_X + i;
    int v = scopeCol[(scopeHead + i) % SCOPE_W];
    int yTop = scopeYof(y, v);

    tft.drawFastVLine(x, y, yTop - y, THEME_BG);                       // ลบของเดิมด้านบน
    if (yTop < y + SCOPE_H)
      tft.drawFastVLine(x, yTop, y + SCOPE_H - yTop,
                        (v >= dropTriggerDelta) ? COLOR_YELLOW : THEME_SKYBLUE);
    // เส้นอ้างอิงวาดทับเฉพาะจุดที่เป็นพื้นหลัง (ทุก ๆ 2 พิกเซลให้เป็นเส้นประ)
    if ((i % 4) < 2) {
      if (dropTriggerDelta < scopeFull && yTrig  < yTop) tft.drawPixel(x, yTrig,  COLOR_ORANGE);
      if (dropReleaseDelta < scopeFull && yRel   < yTop) tft.drawPixel(x, yRel,   THEME_PINK);
      if (sensorNoisePp    < scopeFull && yNoise < yTop) tft.drawPixel(x, yNoise, UI_DIM);
    }
  }
}

// ============================================================================
// ตัวช่วยของหน้าคาลิเบรต
// ============================================================================
int calPeaks[CAL_MAX_SAMPLES];
int calWidths[CAL_MAX_SAMPLES];
int calCount = 0;

int calMedian(int *src, int n) {
  int t[CAL_MAX_SAMPLES];
  memcpy(t, src, sizeof(int) * n);
  for (int i = 1; i < n; i++) {
    int k = t[i], j = i - 1;
    while (j >= 0 && t[j] > k) { t[j + 1] = t[j]; j--; }
    t[j + 1] = k;
  }
  return t[n / 2];
}

int calMinOf(int *src, int n) {
  int m = src[0];
  for (int i = 1; i < n; i++) if (src[i] < m) m = src[i];
  return m;
}

int calMaxOf(int *src, int n) {
  int m = src[0];
  for (int i = 1; i < n; i++) if (src[i] > m) m = src[i];
  return m;
}

const char* calQualityWord(uint8_t q) {
  switch (q) {
    case 4:  return "EXCELLENT";
    case 3:  return "GOOD";
    case 2:  return "FAIR";
    case 1:  return "POOR";
    default: return "TOO WEAK";
  }
}

