kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
uint16_t calQualityColor(uint8_t q) {
  switch (q) {
    case 4:  return COLOR_GREEN;
    case 3:  return UI_GREEN;
    case 2:  return COLOR_YELLOW;
    case 1:  return COLOR_ORANGE;
    default: return COLOR_RED;
  }
}

void calHeader(const char* step, const char* line1, const char* line2) {
  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, 172, 28, THEME_PINK);
  drawCenteredString("CALIBRATION", 8, 1, COLOR_WHITE, THEME_PINK);
  drawCenteredString(step, 36, 1, COLOR_YELLOW, THEME_BG);
  drawCenteredString(line1, 52, 1, COLOR_WHITE, THEME_BG);
  drawCenteredString(line2, 66, 1, UI_DIM, THEME_BG);
  scopeFrame(SCOPE_TOP);
  tft.fillRoundRect(6, 164, 160, 122, 6, THEME_NAVY);
}

bool calButtonPressed() { return digitalRead(BTN_PIN) == LOW; }

// ลูปหลักไม่ได้ทำงานระหว่างอยู่ในหน้าคาลิเบรต จึงต้องมีตัวปิดเสียงของตัวเอง
// (ใช้ beepNonBlocking ตรงนี้ไม่ได้ เพราะไม่มีใครเรียก noTone ให้)
unsigned long calBeepUntil = 0;
void calBeep(uint16_t freq, uint16_t ms) { tone(BUZZER_PIN, freq); calBeepUntil = millis() + ms; }
void calServiceBeep() {
  if (calBeepUntil && millis() >= calBeepUntil) { noTone(BUZZER_PIN); calBeepUntil = 0; }
}

void calWaitRelease() {
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);
}

// แถวค่าตัวเลขในการ์ดผลลัพธ์ (ล้างพื้นก่อนเขียนเสมอ เพื่อไม่ให้ตัวเลขเก่าค้าง)
void calRow(int y, const String &label, const String &value, uint16_t col) {
  tft.fillRect(12, y, 148, 14, THEME_NAVY);
  textAt(label, 12, y, 1, UI_DIM, THEME_NAVY);
  textAt(value, 78, y, 1, col, THEME_NAVY);
}

// ============================================================================
// ขั้นที่ 1 — วัดพื้นสัญญาณรบกวน (ไม่ต้องมีหยด)
// ได้ค่า: เส้นฐาน และสัญญาณรบกวนยอดถึงยอด ซึ่งเป็น "ขีดล่าง" ของเซ็นเซอร์ตัวนี้
// ============================================================================
bool calStepNoise() {
  calHeader("STEP 1 OF 3   NOISE", "NO DROPS PLEASE", "measuring sensor noise");
  drawCenteredString("CLICK = CANCEL", 296, 1, UI_DIM, THEME_BG);
  scopeReset();

  dropTriggerDelta = 4000;            // ปิดการจับพัลส์ชั่วคราว ให้วัดเฉพาะสัญญาณรบกวน
  dropReleaseDelta = 3999;
  scopeFixedFull = 120;               // ซูมให้เห็นย่านสัญญาณรบกวนชัด ๆ
  resetSignalChain(analogRead(SENSOR_AO_PIN));

  int wMin = 4095, wMax = 0;
  unsigned long start = millis();
  unsigned long lastDraw = 0;

  while (millis() - start < CAL_NOISE_MS) {
    if (serviceDropSensor(false)) { /* ไม่นับระหว่างคาลิเบรต */ }
    scopePush(sensorDelta);
    if (sensorFiltered < wMin) wMin = sensorFiltered;
    if (sensorFiltered > wMax) wMax = sensorFiltered;

    if (calButtonPressed()) { calWaitRelease(); scopeFixedFull = 0; return false; }

    if (millis() - lastDraw >= 100) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);
      int pct = (int)((millis() - start) * 100 / CAL_NOISE_MS);
      tft.drawRect(12, 170, 148, 10, UI_LINE);
      tft.fillRect(13, 171, 146 * pct / 100, 8, THEME_CYAN);
      calRow(190, "BASELINE", String(sensorBaseline), COLOR_WHITE);
      calRow(208, "NOISE pp", String(wMax - wMin) + " adc", COLOR_WHITE);
      calRow(226, "LIVE", String(sensorFiltered), THEME_SKYBLUE);
    }
    calServiceBeep();
    delay(1);
  }

  scopeFixedFull = 0;
  calNoisePp = wMax - wMin;
  if (calNoisePp < 1) calNoisePp = 1;

  const char* verdict = (calNoisePp <= 20) ? "VERY QUIET"
                      : (calNoisePp <= 60) ? "OK"
                      : (calNoisePp <= 150) ? "NOISY - SHIELD IT"
                                            : "VERY NOISY";
  uint16_t vcol = (calNoisePp <= 60) ? COLOR_GREEN : (calNoisePp <= 150) ? COLOR_YELLOW : COLOR_RED;
  calRow(208, "NOISE pp", String(calNoisePp) + " adc", vcol);
  calRow(244, "RESULT", String(verdict), vcol);
  modalSafeBeep(2000, 60);
  delay(900);
  return true;
}

// ============================================================================
// ขั้นที่ 2 — เรียนรู้จากหยดจริง
// จับพัลส์จริงด้วยเกณฑ์ไวชั่วคราว (4 เท่าของสัญญาณรบกวน) แล้วเก็บความสูง/ความกว้าง
// พร้อมเดาทิศของสัญญาณให้เอง (หยดทำให้ค่าลดลงหรือเพิ่มขึ้น)
// ============================================================================
bool calStepLearn() {
  calHeader("STEP 2 OF 3   DROPS", "LET IT DRIP NOW", "aim beam below nozzle");
  drawCenteredString("CLICK = DONE", 296, 1, UI_DIM, THEME_BG);
  scopeReset();
  calCount = 0;

  int probe = calNoisePp * 4;
  if (probe < CAL_MIN_TRIGGER) probe = CAL_MIN_TRIGGER;
  dropTriggerDelta = probe;
  dropReleaseDelta = probe * 2 / 5;
  if (dropReleaseDelta < 2) dropReleaseDelta = 2;

  // ---- เดาทิศสัญญาณ: ดูว่าค่าเบนออกจากเส้นฐานไปทางไหนแรงกว่ากัน ----
  dropPolarity = -1;
  resetSignalChain(analogRead(SENSOR_AO_PIN));
  int excDown = 0, excUp = 0;
  unsigned long polStart = millis();
  unsigned long lastDraw = 0;
  bool polarityLocked = false;

  while (!polarityLocked && millis() - polStart < CAL_POLARITY_MS) {
    if (serviceDropSensor(false)) { }
    int d = sensorBaseline - sensorFiltered;
    if (d > excDown) excDown = d;
    if (-d > excUp) excUp = -d;
    if (excDown >= probe || excUp >= probe) polarityLocked = true;
    if (calButtonPressed()) { calWaitRelease(); return false; }
    if (millis() - lastDraw >= 120) {
      lastDraw = millis();
      calRow(172, "SIGNAL", "watching...", THEME_SKYBLUE);
      calRow(190, "DOWN/UP", String(excDown) + " / " + String(excUp), COLOR_WHITE);
    }
    calServiceBeep();
    delay(1);
  }
  if (excUp > excDown) dropPolarity = 1;
  resetSignalChain(analogRead(SENSOR_AO_PIN));
  scopeReset();
  calRow(172, "SIGNAL", (dropPolarity < 0) ? "drop = LOWER" : "drop = HIGHER", COLOR_WHITE);

  // ---- เก็บพัลส์จริง ----
  unsigned long start = millis();
  lastDraw = 0;
  while (calCount < CAL_TARGET_DROPS && millis() - start < CAL_LEARN_TIMEOUT_MS) {
    if (serviceDropSensor(false)) {
      if (lastDropWidthMs <= DROP_MAX_WIDTH_MS && calCount < CAL_MAX_SAMPLES) {
        calPeaks[calCount]  = lastDropPeak;
        calWidths[calCount] = lastDropWidthMs;
        calCount++;
        calBeep(2600, 25);
      }
    }
    scopePush(sensorDelta);

    if (calButtonPressed()) { calWaitRelease(); break; }

    if (millis() - lastDraw >= 100) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);
      calRow(190, "DROPS", String(calCount) + " / " + String(CAL_TARGET_DROPS),
             (calCount >= CAL_MIN_DROPS) ? COLOR_GREEN : COLOR_YELLOW);
      calRow(208, "LAST PK", String(lastDropPeak) + " adc", COLOR_WHITE);
      calRow(226, "LAST W", String(lastDropWidthMs) + " ms", COLOR_WHITE);
      calRow(244, "REJECT", String(rejectedPulses), rejectedPulses ? COLOR_ORANGE : UI_DIM);
      calRow(262, "LIVE", String(sensorDelta), THEME_SKYBLUE);
    }
    calServiceBeep();
    delay(1);
  }

  if (calCount < CAL_MIN_DROPS) {
    calRow(262, "RESULT", "NOT ENOUGH DROPS", COLOR_RED);
    modalSafeBeep(700, 250);
    delay(1600);
    return false;
  }
  modalSafeBeep(2200, 80);
  return true;
}

// ============================================================================
// ขั้นที่ 3 — คำนวณเกณฑ์ที่ดีที่สุดระหว่าง "พ้นสัญญาณรบกวน" กับ "ต่ำกว่าหยดที่จางที่สุด"
// แล้วรายงานอัตราส่วนสัญญาณต่อสัญญาณรบกวน (SNR) ให้เห็นขีดความสามารถจริงของเซ็นเซอร์
// ============================================================================
void calFinish() {
  int medPeak  = calMedian(calPeaks, calCount);
  int maxPeak  = calMaxOf(calPeaks, calCount);
  int medWidth = calMedian(calWidths, calCount);

