kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_5_1/ESP32-S3-Station-V_7_5_1.ino
  // หา "หยดที่จางที่สุดที่ยังน่าเชื่อถือ" โดยตัดพัลส์ที่ต่ำกว่าครึ่งหนึ่งของค่ากลางทิ้ง
  // (พัลส์เตี้ยผิดปกติมักเกิดจากจังหวะที่การอ่านขาดช่วงไปตอนวาดจอ ไม่ใช่หยดที่จางจริง)
  int minPeak = medPeak;
  for (int i = 0; i < calCount; i++)
    if (calPeaks[i] >= medPeak / 2 && calPeaks[i] < minPeak) minPeak = calPeaks[i];

  int noiseFloor = calNoisePp * 3;                 // ต้องสูงกว่าสัญญาณรบกวนอย่างน้อย 3 เท่า
  if (noiseFloor < CAL_MIN_TRIGGER) noiseFloor = CAL_MIN_TRIGGER;
  int signalCap = (minPeak * 55) / 100;            // ต้องต่ำกว่าหยดที่จางที่สุดพอสมควร

  dropTriggerDelta = (noiseFloor + signalCap) / 2; // จุดกึ่งกลางของสองข้อจำกัด
  // ถ้าสัญญาณอ่อนจนสองข้อจำกัดชนกัน อย่างน้อยต้องไม่ตกไปอยู่ในย่านสัญญาณรบกวน
  if (dropTriggerDelta < calNoisePp * 2) dropTriggerDelta = calNoisePp * 2;
  if (dropTriggerDelta < CAL_MIN_TRIGGER) dropTriggerDelta = CAL_MIN_TRIGGER;
  dropReleaseDelta = dropTriggerDelta * 2 / 5;
  if (dropReleaseDelta < 2) dropReleaseDelta = 2;

  calDropAmp = medPeak;
  calSnrX10  = (uint8_t)min(255L, (long)medPeak * 10 / max(1, calNoisePp));
  int spreadPct = (medPeak > 0) ? ((maxPeak - minPeak) * 100 / medPeak) : 999;

  if      (calSnrX10 >= 80) calQuality = 4;
  else if (calSnrX10 >= 50) calQuality = 3;
  else if (calSnrX10 >= 30) calQuality = 2;
  else if (calSnrX10 >= 20) calQuality = 1;
  else                      calQuality = 0;

  stationPrefs.begin("st_cal", false);
  stationPrefs.putInt("pol",   dropPolarity);
  stationPrefs.putInt("trig",  dropTriggerDelta);
  stationPrefs.putInt("rel",   dropReleaseDelta);
  stationPrefs.putInt("amp",   calDropAmp);
  stationPrefs.putInt("noise", calNoisePp);
  stationPrefs.putUChar("snr", calSnrX10);
  stationPrefs.putUChar("q",   calQuality);
  stationPrefs.end();

  calHeader("STEP 3 OF 3   RESULT", "SETTINGS SAVED", "click to verify");
  drawCenteredString("CLICK = VERIFY", 296, 1, UI_DIM, THEME_BG);
  scopeDraw(SCOPE_TOP);

  uint16_t qc = calQualityColor(calQuality);
  calRow(172, "QUALITY", String(calQualityWord(calQuality)), qc);
  calRow(190, "SNR", String(calSnrX10 / 10) + "." + String(calSnrX10 % 10) + " x", qc);
  calRow(208, "DROP PK", String(medPeak) + " adc", COLOR_WHITE);
  calRow(226, "NOISE pp", String(calNoisePp) + " adc", COLOR_WHITE);
  calRow(244, "TRIGGER", String(dropTriggerDelta) + " / " + String(dropReleaseDelta), COLOR_WHITE);
  calRow(262, "WIDTH", String(medWidth) + " ms", COLOR_WHITE);

  if (spreadPct > 80) {
    tft.fillRect(12, 272, 148, 12, THEME_NAVY);
    textCenterIn("UNEVEN-ALIGN SENSOR", 8, 156, 273, 1, COLOR_ORANGE, THEME_NAVY);
  }

  modalSafeBeep(2000, 90);
  delay(120);
  modalSafeBeep(2600, 140);

  unsigned long start = millis();
  while (millis() - start < 12000) {
    if (serviceDropSensor(false)) { }
    if (calButtonPressed()) { calWaitRelease(); break; }
    calServiceBeep();
    delay(2);
  }
}

// ============================================================================
// ขั้นตรวจสอบ — นับหยดจริงด้วยค่าที่เพิ่งได้ ให้ผู้ใช้เทียบกับตาตัวเอง
// ============================================================================
void calVerify() {
  calHeader("VERIFY", "COUNT WITH YOUR EYES", "1 drop must add 1");
  drawCenteredString("CLICK = FINISH", 296, 1, UI_DIM, THEME_BG);
  scopeReset();
  resetSignalChain(analogRead(SENSOR_AO_PIN));

  uint32_t seen = 0;
  uint32_t rejBase = rejectedPulses;
  unsigned long start = millis();
  unsigned long lastDraw = 0;

  while (millis() - start < CAL_VERIFY_MS) {
    if (serviceDropSensor(false)) { seen++; calBeep(2800, 25); }
    scopePush(sensorDelta);
    if (calButtonPressed()) { calWaitRelease(); break; }

    if (millis() - lastDraw >= 100) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);
      tft.fillRect(12, 170, 148, 34, THEME_NAVY);
      drawCenteredString(String(seen), 172, 4, COLOR_GREEN, THEME_NAVY);
      calRow(208, "LAST PK", String(lastDropPeak) + " adc", COLOR_WHITE);
      calRow(226, "LAST W", String(lastDropWidthMs) + " ms", COLOR_WHITE);
      calRow(244, "REJECT", String(rejectedPulses - rejBase),
             (rejectedPulses - rejBase) ? COLOR_ORANGE : UI_DIM);
      int left = (int)((CAL_VERIFY_MS - (millis() - start)) / 1000);
      calRow(262, "TIME", String(left) + " s", UI_DIM);
    }
    calServiceBeep();
    delay(1);
  }
  modalSafeBeep(2400, 80);
}

// ============================================================================
// ตัวคุมลำดับทั้งหมด (เรียกจากการกดปุ่มค้าง 3 วินาที)
// ============================================================================
void executeButtonCalibrationWizard() {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  int keepTrig = dropTriggerDelta, keepRel = dropReleaseDelta;
  int8_t keepPol = dropPolarity;

  bool ok = calStepNoise();
  if (ok) ok = calStepLearn();

  if (ok) {
    calFinish();
    calVerify();
  } else {
    // ยกเลิกหรือเก็บหยดไม่พอ -> คืนค่าเดิม ไม่เขียนทับของที่ใช้ได้อยู่
    dropTriggerDelta = keepTrig;
    dropReleaseDelta = keepRel;
    dropPolarity = keepPol;
    tft.fillScreen(THEME_BG);
    drawCenteredString("CANCELLED", 140, 2, COLOR_YELLOW, THEME_BG);
    drawCenteredString("previous settings kept", 168, 1, UI_DIM, THEME_BG);
    delay(1200);
  }

  noTone(BUZZER_PIN);
  calBeepUntil = 0;
  buzzerBeepUntil = 0;

  // ระหว่างคาลิเบรตไม่ได้นับหยด -> อย่าให้ช่วงที่หายไปกลายเป็นสายพับหรือทำอัตราไหลเพี้ยน
  resetSignalChain(analogRead(SENSOR_AO_PIN));
  if (hasFirstDropOccurred) {
    lastDropTimestamp = millis();
    skipNextInterval = true;
  }
  lastUserActivityTime = millis();
  stateNeedsRedraw = true;
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback (รับ Sync จาก Host)
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnTimeSyncRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int rssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -55;
#else
void OnTimeSyncRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int rssi = -55;
#endif
  if (len != sizeof(struct_host_sync)) return;   // แพ็กเก็ตของ Station อื่น (22 bytes) จะถูกกรองออก

  struct_host_sync syncData;
  memcpy(&syncData, incomingDataBytes, sizeof(syncData));
  lastHostRssi = rssi;
  lastHostRecvTime = millis();
  isHostOnline = true;
  hostReportedChannel = syncData.hostChannel;

  if (syncData.epochTime > 1600000000) {
    struct timeval tv = { (time_t)syncData.epochTime, 0 };
    settimeofday(&tv, NULL);
    isClockSynced = (syncData.isSynced == 1);
  }

  if (syncData.stationId == currentStationId) {
    targetRateHr  = syncData.targetRateHr;
    totalPlanMl   = syncData.totalPlanMl;
    hostAlertCode = syncData.alertCode;
    dropFactor    = safeDropFactor(syncData.dropFactor);
    nearEndPct    = safeNearPct(syncData.nearEndPct);
    hostNearEndAck = (syncData.flags & 0x01) != 0;
    if (hostNearEndAck) nearEndAckRequest = false;   // Host ยืนยันแล้ว

    if (knownResetSeq < 0) {
      knownResetSeq = syncData.resetSeq;          // ครั้งแรกหลังบูต: รับค่าโดยไม่รีเซ็ต
    } else if (syncData.resetSeq != (uint8_t)knownResetSeq) {
      knownResetSeq = syncData.resetSeq;
      pendingCounterReset = true;                  // ให้ loop() เป็นผู้รีเซ็ต
    }
  }
}

void applyCounterReset() {
  pendingCounterReset = false;
  totalDrops = 0;
  periodDropsCounter = 0;
  totalVolumeMl = 0;
  currentFlowRate_ml_hr = 0;
  currentGttMin = 0;
  hasFirstDropOccurred = false;
  skipNextInterval = false;
  isDropFalling = false;
  snoozeUntilTime = 0;
  hostAlertCode = ALERT_NONE;
  hostNearEndAck = false;
  nearEndAckRequest = false;
  nearNextChimeTime = 0;
  nearChimeRemaining = 0;
  if (currentState == STATE_EMERGENCY || currentState == STATE_NEAR_END_NOTICE) currentState = STATE_NORMAL_VIEW;
  resetTrendData();                 // เริ่มถุงใหม่ = เริ่มกราฟแนวโน้มใหม่
  stateNeedsRedraw = true;
  beepNonBlocking(2400, 120);
}

// ----------------------------------------------------------------------------
// ค้นหาช่องสัญญาณของ Host
// ----------------------------------------------------------------------------
void setEspNowChannel(uint8_t ch) {
  if (esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE) == ESP_OK) {
    espnowChannel = ch;
  }
}

void manageChannelHunting(unsigned long now) {
  if (isHostOnline) {
    if (espnowChannel != savedChannel) {
      savedChannel = espnowChannel;
      stationPrefs.begin("st_cfg", false);
      stationPrefs.putUChar("ch", savedChannel);
      stationPrefs.end();
    }
    return;
  }
  if (now < CHANNEL_SCAN_START_MS) return;
  if (currentState == STATE_CONFIG_ID) return;

  if (now - lastChannelHopTime >= CHANNEL_SCAN_DWELL_MS) {
    lastChannelHopTime = now;
    uint8_t next = (espnowChannel % MAX_WIFI_CHANNEL) + 1;
    setEspNowChannel(next);
  }
}

